//音名 不用于赋值，只用于计算
const musicalAlphabetMap = {
  'A2': 100,
  'A#2': 101,
  'Bb2': 101,  // A#2 和 Bb2 是同一个音
  'B2': 102,
  'C1': 103,
  'C#1': 104,
  'Db1': 104,  // C#3 和 Db3 是同一个音
  'D1': 105,
  'D#1': 106,
  'Eb1': 106,  // D#3 和 Eb3 是同一个音
  'E1': 107,
  'F1': 108,
  'F#1': 109,
  'Gb1': 109,  // F#3 和 Gb3 是同一个音
  'G1': 110,
  'G#1': 111,
  'Ab1': 111,  // G#3 和 Ab3 是同一个音
  'A1': 112,
  'A#1': 113,
  'Bb1': 113,  // A#3 和 Bb3 是同一个音
  'B1': 114,
  'C': 115,
  'C#': 116,
  'Db': 116,  // C#4 和 Db4 是同一个音
  'D': 117,
  'D#': 118,
  'Eb': 118,  // D#4 和 Eb4 是同一个音
  'E': 119,
  'F': 120,
  'F#': 121,
  'Gb': 121,  // F#4 和 Gb4 是同一个音
  'G': 122,
  'G#': 123,
  'Ab': 123,  // G#4 和 Ab4 是同一个音
  'A': 124,
  'A#': 125,
  'Bb': 125,  // A#4 和 Bb4 是同一个音
  'B': 126,
  'c': 127,
  'c#':128,
  'db':128,
  'd':129,
  'd#':130,
  'eb':130,
  'e':131,
  'f':132,
  'f#':133,
  'gb':133,
  'g':134,
  'g#':135,
  'ab':135,
  'a':136,
  'a#':137,
  'bb':137,
  'b':138
};
//谱号   用于计算，不用于赋值
const clefMap = {
  'g':10,
  'alto':11,
  'bass':12,
};
//调号  用于计算，不用于赋值
const keySignatureMap = {
  'c':10,
  'd':11,
  'e':12,
  'f':13,
  'g':14,
  'a':15,
  'b':16
};
export {musicalAlphabetMap,clefMap,keySignatureMap};